Ran Plan for project: `test-environment` dir: `resume-qliu-test` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # module.rg-qliuapi-test.azurerm_linux_function_app.func-recordvisit-test will be updated in-place
~ resource "azurerm_linux_function_app" "func-recordvisit-test" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"        = (sensitive value)
          + "APPLICATIONINSIGHTS_CONNECTION_STRING" = (sensitive value)
            # (4 unchanged elements hidden)
        }
        id                                             = "/subscriptions/3c4400b5-5046-4702-992d-360891bd47d3/resourceGroups/rg-qliuapi-test/providers/Microsoft.Web/sites/func-recordvisit-test"
        name                                           = "func-recordvisit-test"
        tags                                           = {
            "Environment" = "Development"
        }
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
          - application_insights_key                      = (sensitive value) -> null
            # (31 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.rg-qliufrontend-test.azurerm_cdn_endpoint_custom_domain.domain-qliufrontend-test will be created
+ resource "azurerm_cdn_endpoint_custom_domain" "domain-qliufrontend-test" {
      + cdn_endpoint_id = "/subscriptions/3c4400b5-5046-4702-992d-360891bd47d3/resourceGroups/rg-qliufrontend-test/providers/Microsoft.Cdn/profiles/cdnp-qliufrontend-test/endpoints/cdne-qliufrontend-test"
      + host_name       = "resumetest.qliu.ca"
      + id              = (known after apply)
      + name            = "qliu-cdn-domain"

      + cdn_managed_https {
          + certificate_type = "Dedicated"
          + protocol_type    = "ServerNameIndication"
          + tls_version      = "TLS12"
        }
    }

  # module.rg-qliufrontend-test.cloudflare_record.dns-qliufrontend-test will be created
+ resource "cloudflare_record" "dns-qliufrontend-test" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "var.dns_name"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + value           = "cdne-qliufrontend-test.azureedge.net"
      + zone_id         = "dc27c744eb7294ab9415ca44e72c3e22"
    }

  # module.rg-qliufrontend-test.time_sleep.wait_60_seconds will be created
+ resource "time_sleep" "wait_60_seconds" {
      + create_duration = "300s"
      + id              = (known after apply)
    }

Plan: 3 to add, 1 to change, 0 to destroy.
Releasing state lock. This may take a few moments...
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p test-environment
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://4e7791a98c5a:4141/lock?id=qingfengliu0%252FAzureIaC%252Fresume-qliu-test%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p test-environment
  ```
Plan: 3 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```